{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "de9a079a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Downloading neo4j-5.7.0.tar.gz (176 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m176.3/176.3 kB\u001b[0m \u001b[31m3.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25h  Installing build dependencies ... \u001b[?25ldone\n",
      "\u001b[?25h  Getting requirements to build wheel ... \u001b[?25ldone\n",
      "\u001b[?25h  Installing backend dependencies ... \u001b[?25ldone\n",
      "\u001b[?25h  Preparing metadata (pyproject.toml) ... \u001b[?25ldone\n",
      "\u001b[?25hRequirement already satisfied: pytz in /Users/dbabichenko/opt/anaconda3/lib/python3.9/site-packages (from neo4j) (2022.1)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (pyproject.toml) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for neo4j: filename=neo4j-5.7.0-py3-none-any.whl size=243940 sha256=4cf16ad0b5758f1399abe0f66e09787047f8eefc3d23aa3e00ba51431f027087\n",
      "  Stored in directory: /Users/dbabichenko/Library/Caches/pip/wheels/6d/be/1e/749b84bba4b7429145ea09ccb46114fab4748625eb319f286a\n",
      "Successfully built neo4j\n",
      "Installing collected packages: neo4j\n",
      "Successfully installed neo4j-5.7.0\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "7aea1d02",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from uuid import uuid4\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "6ae43bad",
   "metadata": {},
   "outputs": [],
   "source": [
    "# The following class is based on the \"Create a graph database in Neo4j using Python\" \n",
    "# tutorial by CJ Sullivan, Feb 10, 2021. \n",
    "# https://towardsdatascience.com/create-a-graph-database-in-neo4j-using-python-4172d40f89c4\n",
    "\n",
    "\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response\n",
    "    \n",
    "    def query_to_dataframe(self, query, parameters=None, db=None):\n",
    "        df = pd.DataFrame([dict(_) for _ in self.query(query, parameters, db)])\n",
    "        return df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "f88911f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://localhost:7687\", \n",
    "                       user=\"neo4j\",              \n",
    "                       pwd=\"admin123\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "533fed6c",
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in range(0, 10):\n",
    "    qry = \"CREATE (f:Flight) SET f.flight_id = '\" + str(uuid4()) + \"' RETURN f;\"\n",
    "    #print(qry)\n",
    "    result = conn.query(qry)\n",
    "    #print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "9b562cf8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record f.flight_id='c359e4e5-3c76-49e3-8cf2-2071d95862f7'>, <Record f.flight_id='6b1533b0-5255-4e03-bf10-850ac63c05a7'>, <Record f.flight_id='c88dc0a8-dbdf-4088-bb12-484b9dc676cb'>, <Record f.flight_id='926b243e-c13b-4307-8f56-89fa7a0cf891'>, <Record f.flight_id='9a9f726e-ac43-481a-80a4-a23f891a68cc'>, <Record f.flight_id='52801f83-9fcd-46e9-82d6-8406c88f67d2'>, <Record f.flight_id='563c1049-485e-4091-a491-a06d746306b1'>, <Record f.flight_id='e92402ff-497f-4a00-aa0c-577db6ff6665'>, <Record f.flight_id='f7ceabd1-6fd6-439d-9a12-4b9cdd21b88b'>, <Record f.flight_id='defe8857-09cf-4432-8461-0df3ecfa279b'>, <Record f.flight_id='42b8f142-f6b0-4cdc-b2da-078b18dde2a4'>]\n"
     ]
    }
   ],
   "source": [
    "qry = \"MATCH (f:Flight) RETURN f.flight_id;\"\n",
    "result = conn.query(qry)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "e3821606",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "c359e4e5-3c76-49e3-8cf2-2071d95862f7\n",
      "6b1533b0-5255-4e03-bf10-850ac63c05a7\n",
      "c88dc0a8-dbdf-4088-bb12-484b9dc676cb\n",
      "926b243e-c13b-4307-8f56-89fa7a0cf891\n",
      "9a9f726e-ac43-481a-80a4-a23f891a68cc\n",
      "52801f83-9fcd-46e9-82d6-8406c88f67d2\n",
      "563c1049-485e-4091-a491-a06d746306b1\n",
      "e92402ff-497f-4a00-aa0c-577db6ff6665\n",
      "f7ceabd1-6fd6-439d-9a12-4b9cdd21b88b\n",
      "defe8857-09cf-4432-8461-0df3ecfa279b\n",
      "42b8f142-f6b0-4cdc-b2da-078b18dde2a4\n"
     ]
    }
   ],
   "source": [
    "for node in result:\n",
    "    print(node[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "fee1ca1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>f.flight_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>c359e4e5-3c76-49e3-8cf2-2071d95862f7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>6b1533b0-5255-4e03-bf10-850ac63c05a7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>c88dc0a8-dbdf-4088-bb12-484b9dc676cb</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>926b243e-c13b-4307-8f56-89fa7a0cf891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>9a9f726e-ac43-481a-80a4-a23f891a68cc</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                            f.flight_id\n",
       "0  c359e4e5-3c76-49e3-8cf2-2071d95862f7\n",
       "1  6b1533b0-5255-4e03-bf10-850ac63c05a7\n",
       "2  c88dc0a8-dbdf-4088-bb12-484b9dc676cb\n",
       "3  926b243e-c13b-4307-8f56-89fa7a0cf891\n",
       "4  9a9f726e-ac43-481a-80a4-a23f891a68cc"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = conn.query_to_dataframe(qry)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "3e384d0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>dep_time</th>\n",
       "      <th>sched_dep_time</th>\n",
       "      <th>dep_delay</th>\n",
       "      <th>arr_time</th>\n",
       "      <th>sched_arr_time</th>\n",
       "      <th>arr_delay</th>\n",
       "      <th>carrier</th>\n",
       "      <th>flight</th>\n",
       "      <th>tailnum</th>\n",
       "      <th>origin</th>\n",
       "      <th>dest</th>\n",
       "      <th>air_time</th>\n",
       "      <th>distance</th>\n",
       "      <th>std</th>\n",
       "      <th>sta</th>\n",
       "      <th>atd</th>\n",
       "      <th>ata</th>\n",
       "      <th>date</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1807.0</td>\n",
       "      <td>1630</td>\n",
       "      <td>97.0</td>\n",
       "      <td>1956.0</td>\n",
       "      <td>1837</td>\n",
       "      <td>79.0</td>\n",
       "      <td>EV</td>\n",
       "      <td>4411</td>\n",
       "      <td>N13566</td>\n",
       "      <td>EWR</td>\n",
       "      <td>MEM</td>\n",
       "      <td>144.0</td>\n",
       "      <td>946</td>\n",
       "      <td>16:30:00</td>\n",
       "      <td>18:37:00</td>\n",
       "      <td>18:07:00</td>\n",
       "      <td>19:56:00</td>\n",
       "      <td>2/26/13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1459.0</td>\n",
       "      <td>1445</td>\n",
       "      <td>14.0</td>\n",
       "      <td>1801.0</td>\n",
       "      <td>1747</td>\n",
       "      <td>14.0</td>\n",
       "      <td>B6</td>\n",
       "      <td>1171</td>\n",
       "      <td>N661JB</td>\n",
       "      <td>LGA</td>\n",
       "      <td>FLL</td>\n",
       "      <td>147.0</td>\n",
       "      <td>1076</td>\n",
       "      <td>14:45:00</td>\n",
       "      <td>17:47:00</td>\n",
       "      <td>14:59:00</td>\n",
       "      <td>18:01:00</td>\n",
       "      <td>8/17/13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1812.0</td>\n",
       "      <td>1815</td>\n",
       "      <td>-3.0</td>\n",
       "      <td>2055.0</td>\n",
       "      <td>2125</td>\n",
       "      <td>-30.0</td>\n",
       "      <td>AS</td>\n",
       "      <td>7</td>\n",
       "      <td>N403AS</td>\n",
       "      <td>EWR</td>\n",
       "      <td>SEA</td>\n",
       "      <td>315.0</td>\n",
       "      <td>2402</td>\n",
       "      <td>18:15:00</td>\n",
       "      <td>21:25:00</td>\n",
       "      <td>18:12:00</td>\n",
       "      <td>20:55:00</td>\n",
       "      <td>2/13/13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2122.0</td>\n",
       "      <td>2115</td>\n",
       "      <td>7.0</td>\n",
       "      <td>2339.0</td>\n",
       "      <td>2353</td>\n",
       "      <td>-14.0</td>\n",
       "      <td>B6</td>\n",
       "      <td>97</td>\n",
       "      <td>N656JB</td>\n",
       "      <td>JFK</td>\n",
       "      <td>DEN</td>\n",
       "      <td>221.0</td>\n",
       "      <td>1626</td>\n",
       "      <td>21:15:00</td>\n",
       "      <td>23:53:00</td>\n",
       "      <td>21:22:00</td>\n",
       "      <td>23:39:00</td>\n",
       "      <td>4/11/13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1832.0</td>\n",
       "      <td>1835</td>\n",
       "      <td>-3.0</td>\n",
       "      <td>2145.0</td>\n",
       "      <td>2155</td>\n",
       "      <td>-10.0</td>\n",
       "      <td>AA</td>\n",
       "      <td>269</td>\n",
       "      <td>N3EYAA</td>\n",
       "      <td>JFK</td>\n",
       "      <td>SEA</td>\n",
       "      <td>358.0</td>\n",
       "      <td>2422</td>\n",
       "      <td>18:35:00</td>\n",
       "      <td>21:55:00</td>\n",
       "      <td>18:32:00</td>\n",
       "      <td>21:45:00</td>\n",
       "      <td>8/5/13</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   dep_time  sched_dep_time  dep_delay  arr_time  sched_arr_time  arr_delay  \\\n",
       "0    1807.0            1630       97.0    1956.0            1837       79.0   \n",
       "1    1459.0            1445       14.0    1801.0            1747       14.0   \n",
       "2    1812.0            1815       -3.0    2055.0            2125      -30.0   \n",
       "3    2122.0            2115        7.0    2339.0            2353      -14.0   \n",
       "4    1832.0            1835       -3.0    2145.0            2155      -10.0   \n",
       "\n",
       "  carrier  flight tailnum origin dest  air_time  distance       std       sta  \\\n",
       "0      EV    4411  N13566    EWR  MEM     144.0       946  16:30:00  18:37:00   \n",
       "1      B6    1171  N661JB    LGA  FLL     147.0      1076  14:45:00  17:47:00   \n",
       "2      AS       7  N403AS    EWR  SEA     315.0      2402  18:15:00  21:25:00   \n",
       "3      B6      97  N656JB    JFK  DEN     221.0      1626  21:15:00  23:53:00   \n",
       "4      AA     269  N3EYAA    JFK  SEA     358.0      2422  18:35:00  21:55:00   \n",
       "\n",
       "        atd       ata     date  \n",
       "0  18:07:00  19:56:00  2/26/13  \n",
       "1  14:59:00  18:01:00  8/17/13  \n",
       "2  18:12:00  20:55:00  2/13/13  \n",
       "3  21:22:00  23:39:00  4/11/13  \n",
       "4  18:32:00  21:45:00   8/5/13  "
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv('flights.csv')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "fa1182a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CREATE (a:Airport {id: 'DEN'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'ATL'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'DCA'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'IAH'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'SFO'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'STL'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'CLE'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MIA'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'EWR'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'IAD'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'LAX'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'IND'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'ORD'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MDW'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'LGA'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'FLL'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'JFK'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'CLT'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'DFW'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'SEA'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MSY'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'TPA'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'JAX'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'SRQ'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'CMH'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'BHM'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MEM'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MCO'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'RDU'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'SJU'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'PBI'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'MSP'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'CVG'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'BOS'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'DTW'}) RETURN a;\n",
      "CREATE (a:Airport {id: 'RSW'}) RETURN a;\n"
     ]
    }
   ],
   "source": [
    "for airport in set(list(df['origin'].unique()) + list(df['dest'].unique())):\n",
    "    qry = \"CREATE (a:Airport {id: '\" + airport + \"'}) RETURN a;\"\n",
    "    print(qry)\n",
    "    conn.query(qry)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "90573a89",
   "metadata": {},
   "outputs": [],
   "source": [
    "for idx, row in df.iterrows():\n",
    "    qry = \"MATCH (a1:Airport),(a2:Airport) WHERE a1.id = '\" + row['origin'] + \"' \"\n",
    "    qry += \" AND a2.id = '\" + row['dest'] + \"' \"\n",
    "    qry += \" CREATE (a1)-[f1:FLIES_TO]->(a2) \"\n",
    "    qry += \" CREATE (a1)<-[f2:FLIES_TO]-(a2) \"\n",
    "    qry += \" RETURN a1, a2, f1, f2;\"\n",
    "    #print(qry)\n",
    "    conn.query(qry)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "0f3051ff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>DEN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ATL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>DCA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>IAH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SFO</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>STL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>CLE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>MIA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>EWR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>IAD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>LAX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>IND</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ORD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>MDW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>LGA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>FLL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>JFK</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>CLT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>DFW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>SEA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>MSY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>TPA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>JAX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>SRQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>CMH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>BHM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>MEM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>MCO</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>RDU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>SJU</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>PBI</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>MSP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>CVG</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>BOS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>DTW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>RSW</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   a.id\n",
       "0   DEN\n",
       "1   ATL\n",
       "2   DCA\n",
       "3   IAH\n",
       "4   SFO\n",
       "5   STL\n",
       "6   CLE\n",
       "7   MIA\n",
       "8   EWR\n",
       "9   IAD\n",
       "10  LAX\n",
       "11  IND\n",
       "12  ORD\n",
       "13  MDW\n",
       "14  LGA\n",
       "15  FLL\n",
       "16  JFK\n",
       "17  CLT\n",
       "18  DFW\n",
       "19  SEA\n",
       "20  MSY\n",
       "21  TPA\n",
       "22  JAX\n",
       "23  SRQ\n",
       "24  CMH\n",
       "25  BHM\n",
       "26  MEM\n",
       "27  MCO\n",
       "28  RDU\n",
       "29  SJU\n",
       "30  PBI\n",
       "31  MSP\n",
       "32  CVG\n",
       "33  BOS\n",
       "34  DTW\n",
       "35  RSW"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"MATCH (a:Airport) RETURN a.id;\"\n",
    "data = conn.query_to_dataframe(qry)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6c5cb2b5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
